insert into films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
values ('Зеленая миля',
        'Пол Эджкомб — начальник блока смертников в тюрьме «Холодная гора»,' ||
        ' каждый из узников которого однажды проходит «зеленую милю» по пути к месту казни.' ||
        ' Пол повидал много заключённых и надзирателей за время работы. Однако гигант Джон Коффи,' ||
        ' обвинённый в страшном преступлении, стал одним из самых необычных обитателей блока.',
        1999, 1, 16, 189, 1);

insert into films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
values ('Властелин колец: Возвращение короля',
        'Повелитель сил тьмы Саурон направляет свою бесчисленную армию под стены Минас-Тирита,' ||
        ' крепости Последней Надежды. Он предвкушает близкую победу,' ||
        ' но именно это мешает ему заметить две крохотные фигурки — хоббитов, приближающихся к Роковой Горе, ' ||
        'где им предстоит уничтожить Кольцо Всевластья.',
        2003, 3, 12, 201, 2);

insert into films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
values ('Тайна Коко',
        '12-летний Мигель живёт в мексиканской деревушке в семье сапожников и тайно мечтает стать музыкантом.' ||
        ' Тайно, потому что в его семье музыка считается проклятием. Когда-то его прапрадед оставил жену,' ||
        ' прапрабабку Мигеля, ради мечты, которая теперь не даёт спокойно жить и его праправнуку.' ||
        ' С тех пор музыкальная тема в семье стала табу. Мигель обнаруживает,' ||
        ' что между ним и его любимым певцом Эрнесто де ла Крусом, ныне покойным, существует некая связь.' ||
        ' Паренёк отправляется к своему кумиру в Страну Мёртвых, где встречает души предков.' ||
        ' Мигель знакомится там с духом-скелетом по имени Гектор, который становится его проводником.' ||
        ' Вдвоём они отправляются на поиски де ла Круса.',
        2017, 2, 12, 105, 5);

insert into films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
values ('Интерстеллар',
        'Когда засуха, пыльные бури и вымирание растений приводят человечество к продовольственному кризису,' ||
        ' коллектив исследователей и учёных отправляется сквозь червоточину ' ||
        '(которая предположительно соединяет области пространства-времени через большое расстояние) в путешествие,' ||
        ' чтобы превзойти прежние ограничения для космических путешествий человека' ||
        ' и найти планету с подходящими для человечества условиями.',
        2014, 4, 16, 169, 3);

insert into films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
values ('Криминальное чтиво',
        'Двое бандитов Винсент Вега и Джулс Винфилд ведут философские беседы в перерывах между разборками' ||
        ' и решением проблем с должниками криминального босса Марселласа Уоллеса. ' ||
        'В первой истории Винсент проводит незабываемый вечер с женой Марселласа Мией.' ||
        ' Во второй рассказывается о боксёре Бутче Кулидже, купленном Уоллесом, чтобы сдать бой.' ||
        ' В третьей истории Винсент и Джулс по нелепой случайности попадают в неприятности.',
        1994, 5, 18, 154, 4);
